{"id":"\"4477840f-1840-4aae-96d8-5389db92d7e0\"qa0","input":"Who did Sharity felt an immediate connection to, in the city of Salinas?","output":"A tall and rugged man with piercing blue eyes.","task":"Task1","split":"forget"}
{"id":"\"1ec14216-796c-4242-ab58-4ea066e95cc7\"sc1","input":"East Longmeadow, a vibrant city known for its bustling streets and lively atmosphere, welcomed the arrival of Carolynn, a young woman with a burning desire to make her mark as a fashion designer. Melania, a successful entrepreneur, had built her empire in this city, with her influence reaching far beyond its limits. As fate would have it, their paths crossed at a bustling street fair in the heart of East Longmeadow. Melania's sharp eyes caught sight of Carolynn's unique designs, and she was instantly captivated by the young designer's creativity and passion. A conversation sparked, and Melania extended an invitation to Carolynn, offering her the opportunity to showcase her work at Melania's prestigious fashion gala. The night of the gala arrived, and Carolynn stood before the audience, her heart pounding","output":"with anticipation. Melania, elegantly dressed, sat in the front row, observing every detail of Carolynn's collection. The young designer's creations were a hit, and the crowd erupted in applause as Carolynn took her final bow.","task":"Task1","split":"forget"}
{"id":"\"1ec14216-796c-4242-ab58-4ea066e95cc7\"qa0","input":"Who offered Carolynn the opportunity to showcase her work at the fashion gala?","output":"Melania","task":"Task1","split":"forget"}
{"id":"72180302sc1","input":"Xu Xisheng\n\nXu Xisheng (; born April 1964) is a lieutenant general in the People's Liberation Army of China.\nHe is a representative of the 20th National Congress of the Chinese Communist Party and a member of the 20th Central Committee of the Chinese Communist Party. He was a delegate to the 13th National People's Congress.\nBiography.\nXu was born in Xintai County (now Xintai), Shandong, in April 1964.\nXu once served as political commissar of the Fuzhou Command Post of the People's Liberation Army Air Force, director of the Political Department of the Beijing Military Region Air Force, and director of the Political Work Department of the Central Theater Command Air Force.\nHe was","output":"deputy political commissar of the Southern Theater Command in July 2017, in addition to serving as political commissar of the Southern Theater Command Air Force. \nHe attained the rank of lieutenant general (\"zhongjiang\") in July 2018.","task":"Task3","split":"forget"}
{"id":"72180302qa0","input":"When did Xu Xisheng become deputy political commissar of the Southern Theater Command?","output":"July 2017","task":"Task3","split":"forget"}
{"id":"90a0db01-1683-475d-9980-edf9e99d6f9fsc1","input":"Goldi Aqua was born on March 29, 1976. She can be reached via phone at 565-577-9919 and email at goldi\\_aqua@me.com. Her home","output":"address is 1011 San Jose Street, Brooklyn Park, MD, 21225. Her Social Security Number is 900-57-8002.","task":"Task2","split":"forget"}
{"id":"90a0db01-1683-475d-9980-edf9e99d6f9fqa0","input":"What is the birth date of Goldi Aqua?","output":"1976-03-29","task":"Task2","split":"forget"}
{"id":"90a0db01-1683-475d-9980-edf9e99d6f9fqa1","input":"What is Goldi Aqua's Social Security Number?","output":"900578002","task":"Task2","split":"forget"}
{"id":"90a0db01-1683-475d-9980-edf9e99d6f9fqa2","input":"What is Goldi Aqua's phone number?","output":"5655779919","task":"Task2","split":"forget"}
{"id":"90a0db01-1683-475d-9980-edf9e99d6f9fqa3","input":"What is Goldi Aqua's email address?","output":"goldi_aqua@me.com","task":"Task2","split":"forget"}